# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "stripe/stripe-cli"

# Binaries
brew "awscli"
brew "bash" # Latest Bash version
brew "coreutils" # Those that come with macOS are outdated
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnupg"
brew "grep"
brew "httpie"
brew "mackup"
brew "mas" # Mac App Store manager
brew "openjdk"
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "stripe"
brew "stripe/stripe-cli/stripe"
brew "stripe/stripe-mock/stripe-mock"
brew "svn" # Needed to install fonts

# Spatie Medialibrary
brew "jpegoptim"
brew "optipng"
brew "pngquant"
brew "svgo"
brew "gifsicle"

# Development
brew "shivammathur/php/php"
brew "shivammathur/php/php@8.0"
brew "shivammathur/php/php@7.4"
brew "composer"
brew "imagemagick"
brew "nginx"
brew "node"
brew "tesseract-lang"
brew "yarn"

# Apps
cask "1password"
cask "1password-cli"
cask "alfred"
cask "bartender"
cask "bettertouchtool"
cask "caffeine"
cask "discord"
cask "docker"
cask "figma"
cask "firefox-developer-edition"
cask "freedom"
cask "google-chrome"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "microsoft-office"
cask "notion"
cask "quicklook-csv"
cask "quicklook-json"
cask "screenflow"
cask "signal"
cask "spotify"
cask "tableplus"
cask "telegram-desktop"
cask "tinkerwell"
cask "vlc"
cask "whatsapp"
cask "zoom"

# Fonts
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-montserrat"
cask "font-open-sans"
cask "font-reenie-beanie"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Mac App Store
mas "GarageBand", id: 682658836
mas "Harvest", id: 506189836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
