# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'oven-sh/bun'
tap 'withgraphite/tap'
tap 'shivammathur/extensions'

# Binaries
brew "awscli"
brew "bash" # Latest Bash version
brew "coreutils" # Those that come with macOS are outdated
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnupg"
brew "grep"
brew "httpie"
brew "mackup"
brew "mas" # Mac App Store manager
brew "openjdk"
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "stripe"
brew "stripe/stripe-cli/stripe"
brew "stripe/stripe-mock/stripe-mock"
brew "svn" # Needed to install fonts

# Spatie Medialibrary
brew "jpegoptim"
brew "optipng"
brew "pngquant"
brew "svgo"
brew "gifsicle"

# Development
brew 'php@8.3'
brew 'shivammathur/extensions/xdebug@8.3'
brew 'shivammathur/extensions/redis@8.3'
brew 'shivammathur/extensions/imagick@8.3'
brew 'shivammathur/extensions/swoole@8.3'

brew 'php@8.2'
brew 'shivammathur/extensions/xdebug@8.2'
brew 'shivammathur/extensions/redis@8.2'
brew 'shivammathur/extensions/imagick@8.2'
brew 'shivammathur/extensions/swoole@8.2'

brew 'php@8.1'
brew 'shivammathur/extensions/xdebug@8.1'
brew 'shivammathur/extensions/redis@8.1'
brew 'shivammathur/extensions/imagick@8.1'
brew 'shivammathur/extensions/swoole@8.1'

brew 'composer'
brew 'node'
brew 'deno'
brew 'oven-sh/bun/bun'
brew 'yarn'
brew 'pnpm'
brew 'go'
brew 'rustup'
brew 'cargo-make'

# Apps
cask "1password"
cask "1password-cli"
cask "arc"
cask "discord"
cask "docker"
cask "figma"
cask "google-chrome"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
cask "linear-linear"
cask "microsoft-office"
cask "notion"
cask "nvidia-geforce-now"
cask "orbstack"
cask "raycast"
cask "spotify"
cask "tableplus"
cask "telegram"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"

# Fonts
cask "font-jetbrains-mono"
cask 'font-inter'
cask "font-lato"
cask "font-montserrat"
cask "font-open-sans"
cask "font-reenie-beanie"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Mac App Store
mas "Keynote", id: 409183694
mas "Xcode", id: 497799835
